// بيانات قسم الرصد الثابتة (نصوص القوائم فقط)

const mainMenuText = `˼‏⬩بــوت ريــم • レム┊🤖˹
❆ـ⋅ ┈── ─━ •⊰✣⊱ • ━─ ──┈ ⋅ـ❆
     ◞قـسـم الـرصـد╎˼‏🧮˹⤹◜
        ◝الاوامــر⇆📍◟
ـ»» ┉ ٠ ┈─ • ⊰ 倖 ⊱ • ─┈ ٠ ┉ ««ـ

⪦ .بدء_الرصد
⪦ .انهاء_الرصد
⪦ .رصد_الكل
⪦ .رصد
⪦ .صحة_الرصد
⪦ .الجويل
⪦ .تصفير_الرصد
 ـ»»——⍟——««ـ
✪ مـرحـبـاً، مـعـكـم بـوت ريـم للاسـتـمـارات الـخـاصـة بــ وزارة ماتسوري🧧
❆ـ⋅ ┈── ─━ •⊰✣⊱ • ━─ ──┈ ⋅ـ❆
~✷┇تــ✍︎ــوقــيــ؏↯:~
◜Hikari✨Matsuri •🧧◝`;

// {entries} تنعوض بقائمة الألقاب والفلوس
const listTemplate = `◝قـائـمـة الـجـويـل⇆💎◟
ـ»» ┉ ٠ ┈─ • ⊰ 倖 ⊱ • ─┈ ٠ ┉ ««ـ
{entries}
ـ»»——⍟——««ـ
✪ قـائـمـة الـجـويـل الـخـاصـة بـالـرصـد🧮.
ـ»» ┉ ٠ ┈─ • ⊰ 倖 ⊱ • ─┈ ٠ ┉ ««ـ`;

module.exports = { mainMenuText, listTemplate };